<?php
//folder size
function GetFolderSize($d ="." ) {
	$h = @opendir($d);
	if($h==0)return 0;
	$sf=0;
	while ($f=readdir($h)){
		if ( $f!= "..") {
			$sf+=filesize($nd=$d."/".$f);
			if($f!="."&&is_dir($nd)){
				$sf+=GetFolderSize ($nd);
			}
		}
	}
	closedir($h);
	return $sf ;
}

//vercia baitus i zmoniu kalba
function baitai($size,$digits=2,$dir=false) {
	$kb=1024; $mb=1024*$kb; $gb=1024*$mb; $tb=1024*$gb;
	if (($size==0)&&($dir)) { return " Nulis"; }
	elseif ($size<$kb) { return $size." Baitai"; }
	elseif ($size<$mb) { return round($size/$kb,$digits)." Kb"; }
	elseif ($size<$gb) { return round($size/$mb,$digits)." Mb"; }
	elseif ($size<$tb) { return round($size/$gb,$digits)." Gb"; }
	else { return round($size/$tb,$digits)." Tb"; }
}

//tikrinam ar toks failas egzistuoja
//jei egzistuoja grazinam nauju pavadinimu
function failas($failas) {
	$i = 1;
	$name = substr(basename($failas), 0, strrpos(basename($failas), "."));
	$name = normalizuoti(strtolower(basename($name)));
	//echo $name;
	//$dir = substr(dirname($failas), 0, strrpos(dirname($failas), "/"));
	$dir = dirname($failas);
	//echo $dir;
	$ext = strrchr($failas,".");
	while (file_exists($failas)) {
		$failas = $dir."/".$name."_".$i.$ext;
		$i++;
	}
	return $failas;
}

//Patikrinam ar paveiksliukas pasiekiamas
function isImage($matches) {
	$img = $matches[1].$matches[3].$matches[4];
	if (@getimagesize($img)) {
		$res = "<img src='".$img."' style='border:0px;'>";
	}
	else {
		$res = "[img]".$img."[/img]";
	}
	return $res;
}

//Patikrinam ar paveiksliukas normalus
function verify_image($file) {
	$txt = html_entity_decode(file_get_contents($file), ENT_QUOTES);
	$image_safe = true;
	if (preg_match("#&\#x([0-9a-f]+);*#i", $txt)) $image_safe = false;
	if (preg_match('#&\#([0-9]+);*#i', $txt)) $image_safe = false;
	if (preg_match("#([a-z]*)=([\`\'\"]*)script:#iU", $txt)) $image_safe = false;
	if (preg_match("#([a-z]*)=([\`\'\"]*)javascript:#iU", $txt)) $image_safe = false;
	if (preg_match("#([a-z]*)=([\'\"]*)vbscript:#iU", $txt)) $image_safe = false;
	if (preg_match("#(<[^>]+)style=([\`\'\"]*).*expression\([^>]*>#iU", $txt)) $image_safe = false;
	if (preg_match("#(<[^>]+)style=([\`\'\"]*).*behaviour\([^>]*>#iU", $txt)) $image_safe = false;
	if (preg_match("#</*(applet|link|style|script|iframe|frame|frameset)[^>]*>#i", $txt)) $image_safe = false;
	return $image_safe;
}

/**
 * Keicia nesamoningus simbolius tvarkingais
 *
 * @param tekstas $string
 * @return A-z._0-9
 */
function alias($text) {
	return normalizuoti($text);
}

function normalizuoti($string) {
	$UTF8_SPECIAL_CHARS2 =
	"\x1A".' !"#$%&\'()+,/;<=>?@[\]^`{|}~�'.
	'� ¡¢£¤¥¦§¨©ª«¬­®¯°±²³´µ¶·¸¹º»¼½�'.
	'�¿×÷ˇ˘˙˚˛˜˝̣̀́̃̉΄΅·βφϑϒϕϖְֱֲֳִֵֶַָֹֻּֽ־ֿ�'.
	'�ׁׂ׃׳״،؛؟ـًٌٍَُِّْ٪฿‌‍‎‏–—―‗‘’‚“”�'.
	'��†‡•…‰′″‹›⁄₧₪₫€№℘™Ωℵ←↑→↓↔↕↵'.
	'⇐⇑⇒⇓⇔∀∂∃∅∆∇∈∉∋∏∑−∕∗∙√∝∞∠∧∨�'.
	'�∪∫∴∼≅≈≠≡≤≥⊂⊃⊄⊆⊇⊕⊗⊥⋅⌐⌠⌡〈〉⑩─�'.
	'��┌┐└┘├┤┬┴┼═║╒╓╔╕╖╗╘╙╚╛╜╝╞╟╠'.
	'╡╢╣╤╥╦╧╨╩╪╫╬▀▄█▌▐░▒▓■▲▼◆◊●�'.
	'�★☎☛☞♠♣♥♦✁✂✃✄✆✇✈✉✌✍✎✏✐✑✒✓✔✕�'.
	'��✗✘✙✚✛✜✝✞✟✠✡✢✣✤✥✦✧✩✪✫✬✭✮✯✰✱'.
	'✲✳✴✵✶✷✸✹✺✻✼✽✾✿❀❁❂❃❄❅❆❇❈❉❊❋�'.
	'�❏❐❑❒❖❘❙❚❛❜❝❞❡❢❣❤❥❦❧❿➉➓➔➘➙➚�'.
	'��➜➝➞➟➠➡➢➣➤➥➦➧➨➩➪➫➬➭➮➯➱➲➳➴➵➶'.
	'➷➸➹➺➻➼➽➾'.
	'　、。〃〈〉《》「」『』【】〒〔〕〖〗〘〙〚〛〶'.
	'�'.
	'�ﹼﹽ'.
	'！＂＃＄％＆＇（）＊＋，－．／：；＜＝＞？＠［＼］＾｀｛｜｝～'.
	'｟｠｡｢｣､･￠￡￢￣￤￥￦￨￩￪￫￬￭￮';
	$UTF8_ROMANIZATION = array(
	'à' => 'a', 'ô' => 'o', 'ď' => 'd', 'ḟ' => 'f', 'ë' => 'e', 'š' => 's', 'ơ' => 'o',
	'ß' => 'ss', 'ă' => 'a', 'ř' => 'r', 'ț' => 't', 'ň' => 'n', 'ā' => 'a', 'ķ' => 'k',
	'ŝ' => 's', 'ỳ' => 'y', 'ņ' => 'n', 'ĺ' => 'l', 'ħ' => 'h', 'ṗ' => 'p', 'ó' => 'o',
	'ú' => 'u', 'ě' => 'e', 'é' => 'e', 'ç' => 'c', 'ẁ' => 'w', 'ċ' => 'c', 'õ' => 'o',
	'ṡ' => 's', 'ø' => 'o', 'ģ' => 'g', 'ŧ' => 't', 'ș' => 's', 'ė' => 'e', 'ĉ' => 'c',
	'ś' => 's', 'î' => 'i', 'ű' => 'u', 'ć' => 'c', 'ę' => 'e', 'ŵ' => 'w', 'ṫ' => 't',
	'ū' => 'u', 'č' => 'c', 'ö' => 'oe', 'è' => 'e', 'ŷ' => 'y', 'ą' => 'a', 'ł' => 'l',
	'ų' => 'u', 'ů' => 'u', 'ş' => 's', 'ğ' => 'g', 'ļ' => 'l', 'ƒ' => 'f', 'ž' => 'z',
	'ẃ' => 'w', 'ḃ' => 'b', 'å' => 'a', 'ì' => 'i', 'ï' => 'i', 'ḋ' => 'd', 'ť' => 't',
	'ŗ' => 'r', 'ä' => 'ae', 'í' => 'i', 'ŕ' => 'r', 'ê' => 'e', 'ü' => 'ue', 'ò' => 'o',
	'ē' => 'e', 'ñ' => 'n', 'ń' => 'n', 'ĥ' => 'h', 'ĝ' => 'g', 'đ' => 'd', 'ĵ' => 'j',
	'ÿ' => 'y', 'ũ' => 'u', 'ŭ' => 'u', 'ư' => 'u', 'ţ' => 't', 'ý' => 'y', 'ő' => 'o',
	'â' => 'a', 'ľ' => 'l', 'ẅ' => 'w', 'ż' => 'z', 'ī' => 'i', 'ã' => 'a', 'ġ' => 'g',
	'ṁ' => 'm', 'ō' => 'o', 'ĩ' => 'i', 'ù' => 'u', 'į' => 'i', 'ź' => 'z', 'á' => 'a',
	'û' => 'u', 'þ' => 'th', 'ð' => 'dh', 'æ' => 'ae', 'µ' => 'u', 'ĕ' => 'e',
	'À' => 'A', 'Ô' => 'O', 'Ď' => 'D', 'Ḟ' => 'F', 'Ë' => 'E', 'Š' => 'S', 'Ơ' => 'O',
	'SS' => 'SS', 'Ă' => 'A', 'Ř' => 'R', 'Ț' => 'T', 'Ň' => 'N', 'Ā' => 'A', 'Ķ' => 'K',
	'Ŝ' => 'S', 'Ỳ' => 'Y', 'Ņ' => 'N', 'Ĺ' => 'L', 'Ħ' => 'H', 'Ṗ' => 'P', 'Ó' => 'O',
	'Ú' => 'U', 'Ě' => 'E', 'É' => 'E', 'Ç' => 'C', 'Ẁ' => 'W', 'Ċ' => 'C', 'Õ' => 'O',
	'Ṡ' => 'S', 'Ø' => 'O', 'Ģ' => 'G', 'Ŧ' => 'T', 'Ș' => 'S', 'Ė' => 'E', 'Ĉ' => 'C',
	'Ś' => 'S', 'Î' => 'I', 'Ű' => 'U', 'Ć' => 'C', 'Ę' => 'E', 'Ŵ' => 'W', 'Ṫ' => 'T',
	'Ū' => 'U', 'Č' => 'C', 'Ö' => 'OE', 'È' => 'E', 'Ŷ' => 'Y', 'Ą' => 'A', 'Ł' => 'L',
	'Ų' => 'U', 'Ů' => 'U', 'Ş' => 'S', 'Ğ' => 'G', 'Ļ' => 'L', 'Ƒ' => 'F', 'Ž' => 'Z',
	'Ẃ' => 'W', 'Ḃ' => 'B', 'Å' => 'A', 'Ì' => 'I', 'Ï' => 'I', 'Ḋ' => 'D', 'Ť' => 'T',
	'Ŗ' => 'R', 'Ä' => 'AE', 'Í' => 'I', 'Ŕ' => 'R', 'Ê' => 'E', 'Ü' => 'UE', 'Ò' => 'O',
	'Ē' => 'E', 'Ñ' => 'N', 'Ń' => 'N', 'Ĥ' => 'H', 'Ĝ' => 'G', 'Đ' => 'D', 'Ĵ' => 'J',
	'Ÿ' => 'Y', 'Ũ' => 'U', 'Ŭ' => 'U', 'Ư' => 'U', 'Ţ' => 'T', 'Ý' => 'Y', 'Ő' => 'O',
	'Â' => 'A', 'Ľ' => 'L', 'Ẅ' => 'W', 'Ż' => 'Z', 'Ī' => 'I', 'Ã' => 'A', 'Ġ' => 'G',
	'Ṁ' => 'M', 'Ō' => 'O', 'Ĩ' => 'I', 'Ù' => 'U', 'Į' => 'I', 'Ź' => 'Z', 'Á' => 'A',
	'Û' => 'U', 'Þ' => 'TH', 'Ð' => 'DH', 'Æ' => 'AE', 'Μ' => 'U', 'Ĕ' => 'E',
	//russian cyrillic
	'а'=>'a','А'=>'A','б'=>'b','Б'=>'B','в'=>'v','В'=>'V','г'=>'g','Г'=>'G',
	'д'=>'d','Д'=>'D','е'=>'e','Е'=>'E','ё'=>'jo','Ё'=>'Jo','ж'=>'zh','Ж'=>'Zh',
	'з'=>'z','З'=>'Z','и'=>'i','И'=>'I','й'=>'j','Й'=>'J','к'=>'k','К'=>'K',
	'л'=>'l','Л'=>'L','м'=>'m','М'=>'M','н'=>'n','Н'=>'N','о'=>'o','О'=>'O',
	'п'=>'p','П'=>'P','р'=>'r','Р'=>'R','с'=>'s','С'=>'S','т'=>'t','Т'=>'T',
	'у'=>'u','У'=>'U','ф'=>'f','Ф'=>'F','х'=>'x','Х'=>'X','ц'=>'c','Ц'=>'C',
	'ч'=>'ch','Ч'=>'Ch','ш'=>'sh','Ш'=>'Sh','щ'=>'sch','Щ'=>'Sch','ъ'=>'',
	'Ъ'=>'','ы'=>'y','Ы'=>'Y','ь'=>'','Ь'=>'','э'=>'eh','Э'=>'Eh','ю'=>'ju',
	'Ю'=>'Ju','я'=>'ja','Я'=>'Ja',
	'А'=>'A','А'=>'A','Б'=>'B','Б'=>'B','В'=>'V','В'=>'V','Г'=>'G','Г'=>'G',
	'Д'=>'D','Д'=>'D','Е'=>'E','Е'=>'E','Ё'=>'JO','Ё'=>'JO','Ж'=>'ZH','Ж'=>'ZH',
	'З'=>'Z','З'=>'Z','И'=>'I','И'=>'I','Й'=>'J','Й'=>'J','К'=>'K','К'=>'K',
	'Л'=>'L','Л'=>'L','М'=>'M','М'=>'M','Н'=>'N','Н'=>'N','О'=>'O','О'=>'O',
	'П'=>'P','П'=>'P','Р'=>'R','Р'=>'R','С'=>'S','С'=>'S','Т'=>'T','Т'=>'T',
	'У'=>'U','У'=>'U','Ф'=>'F','Ф'=>'F','Х'=>'X','Х'=>'X','Ц'=>'C','Ц'=>'C',
	'Ч'=>'CH','Ч'=>'CH','Ш'=>'SH','Ш'=>'SH','Щ'=>'SCH','Щ'=>'SCH','Ъ'=>'',
	'Ъ'=>'','Ы'=>'Y','Ы'=>'Y','Ь'=>'','Ь'=>'','Э'=>'EH','Э'=>'EH','Ю'=>'JU',
	'Ю'=>'JU','Я'=>'JA','Я'=>'JA',
	// Ukrainian cyrillic
	'Ґ'=>'Gh','ґ'=>'gh','Є'=>'Je','є'=>'je','І'=>'I','і'=>'i','Ї'=>'Ji','ї'=>'ji',
	'Ґ'=>'GH','Ґ'=>'GH','Є'=>'JE','Є'=>'JE','І'=>'I','І'=>'I','Ї'=>'JI','Ї'=>'JI',
	// Georgian
	'ა'=>'a','ბ'=>'b','გ'=>'g','დ'=>'d','ე'=>'e','ვ'=>'v','ზ'=>'z','თ'=>'th',
	'ი'=>'i','კ'=>'p','ლ'=>'l','მ'=>'m','ნ'=>'n','ო'=>'o','პ'=>'p','ჟ'=>'zh',
	'რ'=>'r','ს'=>'s','ტ'=>'t','უ'=>'u','ფ'=>'ph','ქ'=>'kh','ღ'=>'gh','ყ'=>'q',
	'შ'=>'sh','ჩ'=>'ch','ც'=>'c','ძ'=>'dh','წ'=>'w','ჭ'=>'j','ხ'=>'x','ჯ'=>'jh',
	'ჰ'=>'xh',
	'ა'=>'A','ბ'=>'B','გ'=>'G','დ'=>'D','ე'=>'E','ვ'=>'V','ზ'=>'Z','თ'=>'TH',
	'ი'=>'I','კ'=>'P','ლ'=>'L','მ'=>'M','ნ'=>'N','ო'=>'O','პ'=>'P','ჟ'=>'ZH',
	'რ'=>'R','ს'=>'S','ტ'=>'T','უ'=>'U','ფ'=>'PH','ქ'=>'KH','ღ'=>'GH','ყ'=>'Q',
	'შ'=>'SH','ჩ'=>'CH','ც'=>'C','ძ'=>'DH','წ'=>'W','ჭ'=>'J','ხ'=>'X','ჯ'=>'JH',
	'ჰ'=>'XH',
	//Sanskrit
	'अ'=>'a','आ'=>'ah','इ'=>'i','ई'=>'ih','उ'=>'u','ऊ'=>'uh','ऋ'=>'ry',
	'ॠ'=>'ryh','ऌ'=>'ly','ॡ'=>'lyh','ए'=>'e','ऐ'=>'ay','ओ'=>'o','औ'=>'aw',
	'अं'=>'amh','अः'=>'aq','क'=>'k','ख'=>'kh','ग'=>'g','घ'=>'gh','ङ'=>'nh',
	'च'=>'c','छ'=>'ch','ज'=>'j','झ'=>'jh','ञ'=>'ny','ट'=>'tq','ठ'=>'tqh',
	'ड'=>'dq','ढ'=>'dqh','ण'=>'nq','त'=>'t','थ'=>'th','द'=>'d','ध'=>'dh',
	'न'=>'n','प'=>'p','फ'=>'ph','ब'=>'b','भ'=>'bh','म'=>'m','य'=>'z','र'=>'r',
	'ल'=>'l','व'=>'v','श'=>'sh','ष'=>'sqh','स'=>'s','ह'=>'x',
	'अ'=>'A','आ'=>'AH','इ'=>'I','ई'=>'IH','उ'=>'U','ऊ'=>'UH','ऋ'=>'RY',
	'ॠ'=>'RYH','ऌ'=>'LY','ॡ'=>'LYH','ए'=>'E','ऐ'=>'AY','ओ'=>'O','औ'=>'AW',
	'अं'=>'AMH','अः'=>'AQ','क'=>'K','ख'=>'KH','ग'=>'G','घ'=>'GH','ङ'=>'NH',
	'च'=>'C','छ'=>'CH','ज'=>'J','झ'=>'JH','ञ'=>'NY','ट'=>'TQ','ठ'=>'TQH',
	'ड'=>'DQ','ढ'=>'DQH','ण'=>'NQ','त'=>'T','थ'=>'TH','द'=>'D','ध'=>'DH',
	'न'=>'N','प'=>'P','फ'=>'PH','ब'=>'B','भ'=>'BH','म'=>'M','य'=>'Z','र'=>'R',
	'ल'=>'L','व'=>'V','श'=>'SH','ष'=>'SQH','स'=>'S','ह'=>'X',
	//Hebrew
	'א'=>'a', 'ב'=>'b','ג'=>'g','ד'=>'d','ה'=>'h','ו'=>'v','ז'=>'z','ח'=>'kh','ט'=>'th',
	'י'=>'y','ך'=>'h','כ'=>'k','ל'=>'l','ם'=>'m','מ'=>'m','ן'=>'n','נ'=>'n',
	'ס'=>'s','ע'=>'ah','ף'=>'f','פ'=>'p','ץ'=>'c','צ'=>'c','ק'=>'q','ר'=>'r',
	'ש'=>'sh','ת'=>'t',
	'א'=>'A', 'ב'=>'B','ג'=>'G','ד'=>'D','ה'=>'H','ו'=>'V','ז'=>'Z','ח'=>'KH','ט'=>'TH',
	'י'=>'Y','ך'=>'H','כ'=>'K','ל'=>'L','ם'=>'M','מ'=>'M','ן'=>'N','נ'=>'N',
	'ס'=>'S','ע'=>'AH','ף'=>'F','פ'=>'P','ץ'=>'C','צ'=>'C','ק'=>'Q','ר'=>'R',
	'ש'=>'SH','ת'=>'T',
	//Arabic
	'ا'=>'a','ب'=>'b','ت'=>'t','ث'=>'th','ج'=>'g','ح'=>'xh','خ'=>'x','د'=>'d',
	'ذ'=>'dh','ر'=>'r','ز'=>'z','س'=>'s','ش'=>'sh','ص'=>'s\'','ض'=>'d\'',
	'ط'=>'t\'','ظ'=>'z\'','ع'=>'y','غ'=>'gh','ف'=>'f','ق'=>'q','ك'=>'k',
	'ل'=>'l','م'=>'m','ن'=>'n','ه'=>'x\'','و'=>'u','ي'=>'i',
	'ا'=>'A','ب'=>'B','ت'=>'T','ث'=>'TH','ج'=>'G','ح'=>'XH','خ'=>'X','د'=>'D',
	'ذ'=>'DH','ر'=>'R','ز'=>'Z','س'=>'S','ش'=>'SH','ص'=>'S\'','ض'=>'D\'',
	'ط'=>'T\'','ظ'=>'Z\'','ع'=>'Y','غ'=>'GH','ف'=>'F','ق'=>'Q','ك'=>'K',
	'ل'=>'L','م'=>'M','ن'=>'N','ه'=>'X\'','و'=>'U','ي'=>'I',

	// Japanese hiragana
	'あ'=>'a','え'=>'e','い'=>'i','お'=>'o','う'=>'u','ば'=>'ba','べ'=>'be',
	'び'=>'bi','ぼ'=>'bo','ぶ'=>'bu','し'=>'ci','だ'=>'da','で'=>'de','ぢ'=>'di',
	'ど'=>'do','づ'=>'du','ふぁ'=>'fa','ふぇ'=>'fe','ふぃ'=>'fi','ふぉ'=>'fo',
	'ふ'=>'fu','が'=>'ga','げ'=>'ge','ぎ'=>'gi','ご'=>'go','ぐ'=>'gu','は'=>'ha',
	'へ'=>'he','ひ'=>'hi','ほ'=>'ho','ふ'=>'hu','じゃ'=>'ja','じぇ'=>'je',
	'じ'=>'ji','じょ'=>'jo','じゅ'=>'ju','か'=>'ka','け'=>'ke','き'=>'ki',
	'こ'=>'ko','く'=>'ku','ら'=>'la','れ'=>'le','り'=>'li','ろ'=>'lo','る'=>'lu',
	'ま'=>'ma','め'=>'me','み'=>'mi','も'=>'mo','む'=>'mu','な'=>'na','ね'=>'ne',
	'に'=>'ni','の'=>'no','ぬ'=>'nu','ぱ'=>'pa','ぺ'=>'pe','ぴ'=>'pi','ぽ'=>'po',
	'ぷ'=>'pu','ら'=>'ra','れ'=>'re','り'=>'ri','ろ'=>'ro','る'=>'ru','さ'=>'sa',
	'せ'=>'se','し'=>'si','そ'=>'so','す'=>'su','た'=>'ta','て'=>'te','ち'=>'ti',
	'と'=>'to','つ'=>'tu','ヴぁ'=>'va','ヴぇ'=>'ve','ヴぃ'=>'vi','ヴぉ'=>'vo',
	'ヴ'=>'vu','わ'=>'wa','うぇ'=>'we','うぃ'=>'wi','を'=>'wo','や'=>'ya','いぇ'=>'ye',
	'い'=>'yi','よ'=>'yo','ゆ'=>'yu','ざ'=>'za','ぜ'=>'ze','じ'=>'zi','ぞ'=>'zo',
	'ず'=>'zu','びゃ'=>'bya','びぇ'=>'bye','びぃ'=>'byi','びょ'=>'byo','びゅ'=>'byu',
	'ちゃ'=>'cha','ちぇ'=>'che','ち'=>'chi','ちょ'=>'cho','ちゅ'=>'chu','ちゃ'=>'cya',
	'ちぇ'=>'cye','ちぃ'=>'cyi','ちょ'=>'cyo','ちゅ'=>'cyu','でゃ'=>'dha','でぇ'=>'dhe',
	'でぃ'=>'dhi','でょ'=>'dho','でゅ'=>'dhu','どぁ'=>'dwa','どぇ'=>'dwe','どぃ'=>'dwi',
	'どぉ'=>'dwo','どぅ'=>'dwu','ぢゃ'=>'dya','ぢぇ'=>'dye','ぢぃ'=>'dyi','ぢょ'=>'dyo',
	'ぢゅ'=>'dyu','ぢ'=>'dzi','ふぁ'=>'fwa','ふぇ'=>'fwe','ふぃ'=>'fwi','ふぉ'=>'fwo',
	'ふぅ'=>'fwu','ふゃ'=>'fya','ふぇ'=>'fye','ふぃ'=>'fyi','ふょ'=>'fyo','ふゅ'=>'fyu',
	'ぎゃ'=>'gya','ぎぇ'=>'gye','ぎぃ'=>'gyi','ぎょ'=>'gyo','ぎゅ'=>'gyu','ひゃ'=>'hya',
	'ひぇ'=>'hye','ひぃ'=>'hyi','ひょ'=>'hyo','ひゅ'=>'hyu','じゃ'=>'jya','じぇ'=>'jye',
	'じぃ'=>'jyi','じょ'=>'jyo','じゅ'=>'jyu','きゃ'=>'kya','きぇ'=>'kye','きぃ'=>'kyi',
	'きょ'=>'kyo','きゅ'=>'kyu','りゃ'=>'lya','りぇ'=>'lye','りぃ'=>'lyi','りょ'=>'lyo',
	'りゅ'=>'lyu','みゃ'=>'mya','みぇ'=>'mye','みぃ'=>'myi','みょ'=>'myo','みゅ'=>'myu',
	'ん'=>'n','にゃ'=>'nya','にぇ'=>'nye','にぃ'=>'nyi','にょ'=>'nyo','にゅ'=>'nyu',
	'ぴゃ'=>'pya','ぴぇ'=>'pye','ぴぃ'=>'pyi','ぴょ'=>'pyo','ぴゅ'=>'pyu','りゃ'=>'rya',
	'りぇ'=>'rye','りぃ'=>'ryi','りょ'=>'ryo','りゅ'=>'ryu','しゃ'=>'sha','しぇ'=>'she',
	'し'=>'shi','しょ'=>'sho','しゅ'=>'shu','すぁ'=>'swa','すぇ'=>'swe','すぃ'=>'swi',
	'すぉ'=>'swo','すぅ'=>'swu','しゃ'=>'sya','しぇ'=>'sye','しぃ'=>'syi','しょ'=>'syo',
	'しゅ'=>'syu','てゃ'=>'tha','てぇ'=>'the','てぃ'=>'thi','てょ'=>'tho','てゅ'=>'thu',
	'つゃ'=>'tsa','つぇ'=>'tse','つぃ'=>'tsi','つょ'=>'tso','つ'=>'tsu','とぁ'=>'twa',
	'とぇ'=>'twe','とぃ'=>'twi','とぉ'=>'two','とぅ'=>'twu','ちゃ'=>'tya','ちぇ'=>'tye',
	'ちぃ'=>'tyi','ちょ'=>'tyo','ちゅ'=>'tyu','ヴゃ'=>'vya','ヴぇ'=>'vye','ヴぃ'=>'vyi',
	'ヴょ'=>'vyo','ヴゅ'=>'vyu','うぁ'=>'wha','うぇ'=>'whe','うぃ'=>'whi','うぉ'=>'who',
	'うぅ'=>'whu','ゑ'=>'wye','ゐ'=>'wyi','じゃ'=>'zha','じぇ'=>'zhe','じぃ'=>'zhi',
	'じょ'=>'zho','じゅ'=>'zhu','じゃ'=>'zya','じぇ'=>'zye','じぃ'=>'zyi','じょ'=>'zyo',
	'じゅ'=>'zyu',
	'あ'=>'A','え'=>'E','い'=>'I','お'=>'O','う'=>'U','ば'=>'BA','べ'=>'BE',
	'び'=>'BI','ぼ'=>'BO','ぶ'=>'BU','し'=>'CI','だ'=>'DA','で'=>'DE','ぢ'=>'DI',
	'ど'=>'DO','づ'=>'DU','ふぁ'=>'FA','ふぇ'=>'FE','ふぃ'=>'FI','ふぉ'=>'FO',
	'ふ'=>'FU','が'=>'GA','げ'=>'GE','ぎ'=>'GI','ご'=>'GO','ぐ'=>'GU','は'=>'HA',
	'へ'=>'HE','ひ'=>'HI','ほ'=>'HO','ふ'=>'HU','じゃ'=>'JA','じぇ'=>'JE',
	'じ'=>'JI','じょ'=>'JO','じゅ'=>'JU','か'=>'KA','け'=>'KE','き'=>'KI',
	'こ'=>'KO','く'=>'KU','ら'=>'LA','れ'=>'LE','り'=>'LI','ろ'=>'LO','る'=>'LU',
	'ま'=>'MA','め'=>'ME','み'=>'MI','も'=>'MO','む'=>'MU','な'=>'NA','ね'=>'NE',
	'に'=>'NI','の'=>'NO','ぬ'=>'NU','ぱ'=>'PA','ぺ'=>'PE','ぴ'=>'PI','ぽ'=>'PO',
	'ぷ'=>'PU','ら'=>'RA','れ'=>'RE','り'=>'RI','ろ'=>'RO','る'=>'RU','さ'=>'SA',
	'せ'=>'SE','し'=>'SI','そ'=>'SO','す'=>'SU','た'=>'TA','て'=>'TE','ち'=>'TI',
	'と'=>'TO','つ'=>'TU','ヴぁ'=>'VA','ヴぇ'=>'VE','ヴぃ'=>'VI','ヴぉ'=>'VO',
	'ヴ'=>'VU','わ'=>'WA','うぇ'=>'WE','うぃ'=>'WI','を'=>'WO','や'=>'YA','いぇ'=>'YE',
	'い'=>'YI','よ'=>'YO','ゆ'=>'YU','ざ'=>'ZA','ぜ'=>'ZE','じ'=>'ZI','ぞ'=>'ZO',
	'ず'=>'ZU','びゃ'=>'BYA','びぇ'=>'BYE','びぃ'=>'BYI','びょ'=>'BYO','びゅ'=>'BYU',
	'ちゃ'=>'CHA','ちぇ'=>'CHE','ち'=>'CHI','ちょ'=>'CHO','ちゅ'=>'CHU','ちゃ'=>'CYA',
	'ちぇ'=>'CYE','ちぃ'=>'CYI','ちょ'=>'CYO','ちゅ'=>'CYU','でゃ'=>'DHA','でぇ'=>'DHE',
	'でぃ'=>'DHI','でょ'=>'DHO','でゅ'=>'DHU','どぁ'=>'DWA','どぇ'=>'DWE','どぃ'=>'DWI',
	'どぉ'=>'DWO','どぅ'=>'DWU','ぢゃ'=>'DYA','ぢぇ'=>'DYE','ぢぃ'=>'DYI','ぢょ'=>'DYO',
	'ぢゅ'=>'DYU','ぢ'=>'DZI','ふぁ'=>'FWA','ふぇ'=>'FWE','ふぃ'=>'FWI','ふぉ'=>'FWO',
	'ふぅ'=>'FWU','ふゃ'=>'FYA','ふぇ'=>'FYE','ふぃ'=>'FYI','ふょ'=>'FYO','ふゅ'=>'FYU',
	'ぎゃ'=>'GYA','ぎぇ'=>'GYE','ぎぃ'=>'GYI','ぎょ'=>'GYO','ぎゅ'=>'GYU','ひゃ'=>'HYA',
	'ひぇ'=>'HYE','ひぃ'=>'HYI','ひょ'=>'HYO','ひゅ'=>'HYU','じゃ'=>'JYA','じぇ'=>'JYE',
	'じぃ'=>'JYI','じょ'=>'JYO','じゅ'=>'JYU','きゃ'=>'KYA','きぇ'=>'KYE','きぃ'=>'KYI',
	'きょ'=>'KYO','きゅ'=>'KYU','りゃ'=>'LYA','りぇ'=>'LYE','りぃ'=>'LYI','りょ'=>'LYO',
	'りゅ'=>'LYU','みゃ'=>'MYA','みぇ'=>'MYE','みぃ'=>'MYI','みょ'=>'MYO','みゅ'=>'MYU',
	'ん'=>'N','にゃ'=>'NYA','にぇ'=>'NYE','にぃ'=>'NYI','にょ'=>'NYO','にゅ'=>'NYU',
	'ぴゃ'=>'PYA','ぴぇ'=>'PYE','ぴぃ'=>'PYI','ぴょ'=>'PYO','ぴゅ'=>'PYU','りゃ'=>'RYA',
	'りぇ'=>'RYE','りぃ'=>'RYI','りょ'=>'RYO','りゅ'=>'RYU','しゃ'=>'SHA','しぇ'=>'SHE',
	'し'=>'SHI','しょ'=>'SHO','しゅ'=>'SHU','すぁ'=>'SWA','すぇ'=>'SWE','すぃ'=>'SWI',
	'すぉ'=>'SWO','すぅ'=>'SWU','しゃ'=>'SYA','しぇ'=>'SYE','しぃ'=>'SYI','しょ'=>'SYO',
	'しゅ'=>'SYU','てゃ'=>'THA','てぇ'=>'THE','てぃ'=>'THI','てょ'=>'THO','てゅ'=>'THU',
	'つゃ'=>'TSA','つぇ'=>'TSE','つぃ'=>'TSI','つょ'=>'TSO','つ'=>'TSU','とぁ'=>'TWA',
	'とぇ'=>'TWE','とぃ'=>'TWI','とぉ'=>'TWO','とぅ'=>'TWU','ちゃ'=>'TYA','ちぇ'=>'TYE',
	'ちぃ'=>'TYI','ちょ'=>'TYO','ちゅ'=>'TYU','ヴゃ'=>'VYA','ヴぇ'=>'VYE','ヴぃ'=>'VYI',
	'ヴょ'=>'VYO','ヴゅ'=>'VYU','うぁ'=>'WHA','うぇ'=>'WHE','うぃ'=>'WHI','うぉ'=>'WHO',
	'うぅ'=>'WHU','ゑ'=>'WYE','ゐ'=>'WYI','じゃ'=>'ZHA','じぇ'=>'ZHE','じぃ'=>'ZHI',
	'じょ'=>'ZHO','じゅ'=>'ZHU','じゃ'=>'ZYA','じぇ'=>'ZYE','じぃ'=>'ZYI','じょ'=>'ZYO',
	'じゅ'=>'ZYU',
	// Japanese katakana
	'ア'=>'a','エ'=>'e','イ'=>'i','オ'=>'o','ウ'=>'u','バ'=>'ba','ベ'=>'be','ビ'=>'bi',
	'ボ'=>'bo','ブ'=>'bu','シ'=>'ci','ダ'=>'da','デ'=>'de','ヂ'=>'di','ド'=>'do',
	'ヅ'=>'du','ファ'=>'fa','フェ'=>'fe','フィ'=>'fi','フォ'=>'fo','フ'=>'fu','ガ'=>'ga',
	'ゲ'=>'ge','ギ'=>'gi','ゴ'=>'go','グ'=>'gu','ハ'=>'ha','ヘ'=>'he','ヒ'=>'hi','ホ'=>'ho',
	'フ'=>'hu','ジャ'=>'ja','ジェ'=>'je','ジ'=>'ji','ジョ'=>'jo','ジュ'=>'ju','カ'=>'ka',
	'ケ'=>'ke','キ'=>'ki','コ'=>'ko','ク'=>'ku','ラ'=>'la','レ'=>'le','リ'=>'li','ロ'=>'lo',
	'ル'=>'lu','マ'=>'ma','メ'=>'me','ミ'=>'mi','モ'=>'mo','ム'=>'mu','ナ'=>'na','ネ'=>'ne',
	'ニ'=>'ni','ノ'=>'no','ヌ'=>'nu','パ'=>'pa','ペ'=>'pe','ピ'=>'pi','ポ'=>'po','プ'=>'pu',
	'ラ'=>'ra','レ'=>'re','リ'=>'ri','ロ'=>'ro','ル'=>'ru','サ'=>'sa','セ'=>'se','シ'=>'si',
	'ソ'=>'so','ス'=>'su','タ'=>'ta','テ'=>'te','チ'=>'ti','ト'=>'to','ツ'=>'tu','ヴァ'=>'va',
	'ヴェ'=>'ve','ヴィ'=>'vi','ヴォ'=>'vo','ヴ'=>'vu','ワ'=>'wa','ウェ'=>'we','ウィ'=>'wi',
	'ヲ'=>'wo','ヤ'=>'ya','イェ'=>'ye','イ'=>'yi','ヨ'=>'yo','ユ'=>'yu','ザ'=>'za','ゼ'=>'ze',
	'ジ'=>'zi','ゾ'=>'zo','ズ'=>'zu','ビャ'=>'bya','ビェ'=>'bye','ビィ'=>'byi','ビョ'=>'byo',
	'ビュ'=>'byu','チャ'=>'cha','チェ'=>'che','チ'=>'chi','チョ'=>'cho','チュ'=>'chu',
	'チャ'=>'cya','チェ'=>'cye','チィ'=>'cyi','チョ'=>'cyo','チュ'=>'cyu','デャ'=>'dha',
	'デェ'=>'dhe','ディ'=>'dhi','デョ'=>'dho','デュ'=>'dhu','ドァ'=>'dwa','ドェ'=>'dwe',
	'ドィ'=>'dwi','ドォ'=>'dwo','ドゥ'=>'dwu','ヂャ'=>'dya','ヂェ'=>'dye','ヂィ'=>'dyi',
	'ヂョ'=>'dyo','ヂュ'=>'dyu','ヂ'=>'dzi','ファ'=>'fwa','フェ'=>'fwe','フィ'=>'fwi',
	'フォ'=>'fwo','フゥ'=>'fwu','フャ'=>'fya','フェ'=>'fye','フィ'=>'fyi','フョ'=>'fyo',
	'フュ'=>'fyu','ギャ'=>'gya','ギェ'=>'gye','ギィ'=>'gyi','ギョ'=>'gyo','ギュ'=>'gyu',
	'ヒャ'=>'hya','ヒェ'=>'hye','ヒィ'=>'hyi','ヒョ'=>'hyo','ヒュ'=>'hyu','ジャ'=>'jya',
	'ジェ'=>'jye','ジィ'=>'jyi','ジョ'=>'jyo','ジュ'=>'jyu','キャ'=>'kya','キェ'=>'kye',
	'キィ'=>'kyi','キョ'=>'kyo','キュ'=>'kyu','リャ'=>'lya','リェ'=>'lye','リィ'=>'lyi',
	'リョ'=>'lyo','リュ'=>'lyu','ミャ'=>'mya','ミェ'=>'mye','ミィ'=>'myi','ミョ'=>'myo',
	'ミュ'=>'myu','ン'=>'n','ニャ'=>'nya','ニェ'=>'nye','ニィ'=>'nyi','ニョ'=>'nyo',
	'ニュ'=>'nyu','ピャ'=>'pya','ピェ'=>'pye','ピィ'=>'pyi','ピョ'=>'pyo','ピュ'=>'pyu',
	'リャ'=>'rya','リェ'=>'rye','リィ'=>'ryi','リョ'=>'ryo','リュ'=>'ryu','シャ'=>'sha',
	'シェ'=>'she','シ'=>'shi','ショ'=>'sho','シュ'=>'shu','スァ'=>'swa','スェ'=>'swe',
	'スィ'=>'swi','スォ'=>'swo','スゥ'=>'swu','シャ'=>'sya','シェ'=>'sye','シィ'=>'syi',
	'ショ'=>'syo','シュ'=>'syu','テャ'=>'tha','テェ'=>'the','ティ'=>'thi','テョ'=>'tho',
	'テュ'=>'thu','ツャ'=>'tsa','ツェ'=>'tse','ツィ'=>'tsi','ツョ'=>'tso','ツ'=>'tsu',
	'トァ'=>'twa','トェ'=>'twe','トィ'=>'twi','トォ'=>'two','トゥ'=>'twu','チャ'=>'tya',
	'チェ'=>'tye','チィ'=>'tyi','チョ'=>'tyo','チュ'=>'tyu','ヴャ'=>'vya','ヴェ'=>'vye',
	'ヴィ'=>'vyi','ヴョ'=>'vyo','ヴュ'=>'vyu','ウァ'=>'wha','ウェ'=>'whe','ウィ'=>'whi',
	'ウォ'=>'who','ウゥ'=>'whu','ヱ'=>'wye','ヰ'=>'wyi','ジャ'=>'zha','ジェ'=>'zhe',
	'ジィ'=>'zhi','ジョ'=>'zho','ジュ'=>'zhu','ジャ'=>'zya','ジェ'=>'zye','ジィ'=>'zyi',
	'ジョ'=>'zyo','ジュ'=>'zyu',
	'ア'=>'A','エ'=>'E','イ'=>'I','オ'=>'O','ウ'=>'U','バ'=>'BA','ベ'=>'BE','ビ'=>'BI',
	'ボ'=>'BO','ブ'=>'BU','シ'=>'CI','ダ'=>'DA','デ'=>'DE','ヂ'=>'DI','ド'=>'DO',
	'ヅ'=>'DU','ファ'=>'FA','フェ'=>'FE','フィ'=>'FI','フォ'=>'FO','フ'=>'FU','ガ'=>'GA',
	'ゲ'=>'GE','ギ'=>'GI','ゴ'=>'GO','グ'=>'GU','ハ'=>'HA','ヘ'=>'HE','ヒ'=>'HI','ホ'=>'HO',
	'フ'=>'HU','ジャ'=>'JA','ジェ'=>'JE','ジ'=>'JI','ジョ'=>'JO','ジュ'=>'JU','カ'=>'KA',
	'ケ'=>'KE','キ'=>'KI','コ'=>'KO','ク'=>'KU','ラ'=>'LA','レ'=>'LE','リ'=>'LI','ロ'=>'LO',
	'ル'=>'LU','マ'=>'MA','メ'=>'ME','ミ'=>'MI','モ'=>'MO','ム'=>'MU','ナ'=>'NA','ネ'=>'NE',
	'ニ'=>'NI','ノ'=>'NO','ヌ'=>'NU','パ'=>'PA','ペ'=>'PE','ピ'=>'PI','ポ'=>'PO','プ'=>'PU',
	'ラ'=>'RA','レ'=>'RE','リ'=>'RI','ロ'=>'RO','ル'=>'RU','サ'=>'SA','セ'=>'SE','シ'=>'SI',
	'ソ'=>'SO','ス'=>'SU','タ'=>'TA','テ'=>'TE','チ'=>'TI','ト'=>'TO','ツ'=>'TU','ヴァ'=>'VA',
	'ヴェ'=>'VE','ヴィ'=>'VI','ヴォ'=>'VO','ヴ'=>'VU','ワ'=>'WA','ウェ'=>'WE','ウィ'=>'WI',
	'ヲ'=>'WO','ヤ'=>'YA','イェ'=>'YE','イ'=>'YI','ヨ'=>'YO','ユ'=>'YU','ザ'=>'ZA','ゼ'=>'ZE',
	'ジ'=>'ZI','ゾ'=>'ZO','ズ'=>'ZU','ビャ'=>'BYA','ビェ'=>'BYE','ビィ'=>'BYI','ビョ'=>'BYO',
	'ビュ'=>'BYU','チャ'=>'CHA','チェ'=>'CHE','チ'=>'CHI','チョ'=>'CHO','チュ'=>'CHU',
	'チャ'=>'CYA','チェ'=>'CYE','チィ'=>'CYI','チョ'=>'CYO','チュ'=>'CYU','デャ'=>'DHA',
	'デェ'=>'DHE','ディ'=>'DHI','デョ'=>'DHO','デュ'=>'DHU','ドァ'=>'DWA','ドェ'=>'DWE',
	'ドィ'=>'DWI','ドォ'=>'DWO','ドゥ'=>'DWU','ヂャ'=>'DYA','ヂェ'=>'DYE','ヂィ'=>'DYI',
	'ヂョ'=>'DYO','ヂュ'=>'DYU','ヂ'=>'DZI','ファ'=>'FWA','フェ'=>'FWE','フィ'=>'FWI',
	'フォ'=>'FWO','フゥ'=>'FWU','フャ'=>'FYA','フェ'=>'FYE','フィ'=>'FYI','フョ'=>'FYO',
	'フュ'=>'FYU','ギャ'=>'GYA','ギェ'=>'GYE','ギィ'=>'GYI','ギョ'=>'GYO','ギュ'=>'GYU',
	'ヒャ'=>'HYA','ヒェ'=>'HYE','ヒィ'=>'HYI','ヒョ'=>'HYO','ヒュ'=>'HYU','ジャ'=>'JYA',
	'ジェ'=>'JYE','ジィ'=>'JYI','ジョ'=>'JYO','ジュ'=>'JYU','キャ'=>'KYA','キェ'=>'KYE',
	'キィ'=>'KYI','キョ'=>'KYO','キュ'=>'KYU','リャ'=>'LYA','リェ'=>'LYE','リィ'=>'LYI',
	'リョ'=>'LYO','リュ'=>'LYU','ミャ'=>'MYA','ミェ'=>'MYE','ミィ'=>'MYI','ミョ'=>'MYO',
	'ミュ'=>'MYU','ン'=>'N','ニャ'=>'NYA','ニェ'=>'NYE','ニィ'=>'NYI','ニョ'=>'NYO',
	'ニュ'=>'NYU','ピャ'=>'PYA','ピェ'=>'PYE','ピィ'=>'PYI','ピョ'=>'PYO','ピュ'=>'PYU',
	'リャ'=>'RYA','リェ'=>'RYE','リィ'=>'RYI','リョ'=>'RYO','リュ'=>'RYU','シャ'=>'SHA',
	'シェ'=>'SHE','シ'=>'SHI','ショ'=>'SHO','シュ'=>'SHU','スァ'=>'SWA','スェ'=>'SWE',
	'スィ'=>'SWI','スォ'=>'SWO','スゥ'=>'SWU','シャ'=>'SYA','シェ'=>'SYE','シィ'=>'SYI',
	'ショ'=>'SYO','シュ'=>'SYU','テャ'=>'THA','テェ'=>'THE','ティ'=>'THI','テョ'=>'THO',
	'テュ'=>'THU','ツャ'=>'TSA','ツェ'=>'TSE','ツィ'=>'TSI','ツョ'=>'TSO','ツ'=>'TSU',
	'トァ'=>'TWA','トェ'=>'TWE','トィ'=>'TWI','トォ'=>'TWO','トゥ'=>'TWU','チャ'=>'TYA',
	'チェ'=>'TYE','チィ'=>'TYI','チョ'=>'TYO','チュ'=>'TYU','ヴャ'=>'VYA','ヴェ'=>'VYE',
	'ヴィ'=>'VYI','ヴョ'=>'VYO','ヴュ'=>'VYU','ウァ'=>'WHA','ウェ'=>'WHE','ウィ'=>'WHI',
	'ウォ'=>'WHO','ウゥ'=>'WHU','ヱ'=>'WYE','ヰ'=>'WYI','ジャ'=>'ZHA','ジェ'=>'ZHE',
	'ジィ'=>'ZHI','ジョ'=>'ZHO','ジュ'=>'ZHU','ジャ'=>'ZYA','ジェ'=>'ZYE','ジィ'=>'ZYI',
	'ジョ'=>'ZYO','ジュ'=>'ZYU',

	// "Greeklish"
	'Γ'=>'G','Δ'=>'E','Θ'=>'Th','Λ'=>'L','Ξ'=>'X','Π'=>'P','Σ'=>'S','Φ'=>'F','Ψ'=>'Ps',
	'γ'=>'g','δ'=>'e','θ'=>'th','λ'=>'l','ξ'=>'x','π'=>'p','σ'=>'s','φ'=>'f','ψ'=>'ps',
	'Γ'=>'G','Δ'=>'E','Θ'=>'TH','Λ'=>'L','Ξ'=>'X','Π'=>'P','Σ'=>'S','Φ'=>'F','Ψ'=>'PS',
	'Γ'=>'G','Δ'=>'E','Θ'=>'TH','Λ'=>'L','Ξ'=>'X','Π'=>'P','Σ'=>'S','Φ'=>'F','Ψ'=>'PS',

	// Thai
	'ก'=>'k','ข'=>'kh','ฃ'=>'kh','ค'=>'kh','ฅ'=>'kh','ฆ'=>'kh','ง'=>'ng','จ'=>'ch',
	'ฉ'=>'ch','ช'=>'ch','ซ'=>'s','ฌ'=>'ch','ญ'=>'y','ฎ'=>'d','ฏ'=>'t','ฐ'=>'th',
	'ฑ'=>'d','ฒ'=>'th','ณ'=>'n','ด'=>'d','ต'=>'t','ถ'=>'th','ท'=>'th','ธ'=>'th',
	'น'=>'n','บ'=>'b','ป'=>'p','ผ'=>'ph','ฝ'=>'f','พ'=>'ph','ฟ'=>'f','ภ'=>'ph',
	'ม'=>'m','ย'=>'y','ร'=>'r','ฤ'=>'rue','ฤๅ'=>'rue','ล'=>'l','ฦ'=>'lue',
	'ฦๅ'=>'lue','ว'=>'w','ศ'=>'s','ษ'=>'s','ส'=>'s','ห'=>'h','ฬ'=>'l','ฮ'=>'h',
	'ะ'=>'a','–ั'=>'a','รร'=>'a','า'=>'a','รร'=>'an','ำ'=>'am','–ิ'=>'i','–ี'=>'i',
	'–ึ'=>'ue','–ื'=>'ue','–ุ'=>'u','–ู'=>'u','เะ'=>'e','เ–็'=>'e','เ'=>'e','แะ'=>'ae',
	'แ'=>'ae','โะ'=>'o','โ'=>'o','เาะ'=>'o','อ'=>'o','เอะ'=>'oe','เ–ิ'=>'oe',
	'เอ'=>'oe','เ–ียะ'=>'ia','เ–ีย'=>'ia','เ–ือะ'=>'uea','เ–ือ'=>'uea','–ัวะ'=>'ua',
	'–ัว'=>'ua','ว'=>'ua','ใ'=>'ai','ไ'=>'ai','–ัย'=>'ai','ไย'=>'ai','าย'=>'ai',
	'เา'=>'ao','าว'=>'ao','–ุย'=>'ui','โย'=>'oi','อย'=>'oi','เย'=>'oei','เ–ือย'=>'ueai',
	'วย'=>'uai','–ิว'=>'io','เ–็ว'=>'eo','เว'=>'eo','แ–็ว'=>'aeo','แว'=>'aeo',
	'เ–ียว'=>'iao',
	'ก'=>'K','ข'=>'KH','ฃ'=>'KH','ค'=>'KH','ฅ'=>'KH','ฆ'=>'KH','ง'=>'NG','จ'=>'CH',
	'ฉ'=>'CH','ช'=>'CH','ซ'=>'S','ฌ'=>'CH','ญ'=>'Y','ฎ'=>'D','ฏ'=>'T','ฐ'=>'TH',
	'ฑ'=>'D','ฒ'=>'TH','ณ'=>'N','ด'=>'D','ต'=>'T','ถ'=>'TH','ท'=>'TH','ธ'=>'TH',
	'น'=>'N','บ'=>'B','ป'=>'P','ผ'=>'PH','ฝ'=>'F','พ'=>'PH','ฟ'=>'F','ภ'=>'PH',
	'ม'=>'M','ย'=>'Y','ร'=>'R','ฤ'=>'RUE','ฤๅ'=>'RUE','ล'=>'L','ฦ'=>'LUE',
	'ฦๅ'=>'LUE','ว'=>'W','ศ'=>'S','ษ'=>'S','ส'=>'S','ห'=>'H','ฬ'=>'L','ฮ'=>'H',
	'ะ'=>'A','–ั'=>'A','รร'=>'A','า'=>'A','รร'=>'AN','ำ'=>'AM','–ิ'=>'I','–ี'=>'I',
	'–ึ'=>'UE','–ื'=>'UE','–ุ'=>'U','–ู'=>'U','เะ'=>'E','เ–็'=>'E','เ'=>'E','แะ'=>'AE',
	'แ'=>'AE','โะ'=>'O','โ'=>'O','เาะ'=>'O','อ'=>'O','เอะ'=>'OE','เ–ิ'=>'OE',
	'เอ'=>'OE','เ–ียะ'=>'IA','เ–ีย'=>'IA','เ–ือะ'=>'UEA','เ–ือ'=>'UEA','–ัวะ'=>'UA',
	'–ัว'=>'UA','ว'=>'UA','ใ'=>'AI','ไ'=>'AI','–ัย'=>'AI','ไย'=>'AI','าย'=>'AI',
	'เา'=>'AO','าว'=>'AO','–ุย'=>'UI','โย'=>'OI','อย'=>'OI','เย'=>'OEI','เ–ือย'=>'UEAI',
	'วย'=>'UAI','–ิว'=>'IO','เ–็ว'=>'EO','เว'=>'EO','แ–็ว'=>'AEO','แว'=>'AEO',
	'เ–ียว'=>'IAO',

	// Korean
	'ㄱ'=>'k','ㅋ'=>'kh','ㄲ'=>'kk','ㄷ'=>'t','ㅌ'=>'th','ㄸ'=>'tt','ㅂ'=>'p',
	'ㅍ'=>'ph','ㅃ'=>'pp','ㅈ'=>'c','ㅊ'=>'ch','ㅉ'=>'cc','ㅅ'=>'s','ㅆ'=>'ss',
	'ㅎ'=>'h','ㅇ'=>'ng','ㄴ'=>'n','ㄹ'=>'l','ㅁ'=>'m', 'ㅏ'=>'a','ㅓ'=>'e','ㅗ'=>'o',
	'ㅜ'=>'wu','ㅡ'=>'u','ㅣ'=>'i','ㅐ'=>'ay','ㅔ'=>'ey','ㅚ'=>'oy','ㅘ'=>'wa','ㅝ'=>'we',
	'ㅟ'=>'wi','ㅙ'=>'way','ㅞ'=>'wey','ㅢ'=>'uy','ㅑ'=>'ya','ㅕ'=>'ye','ㅛ'=>'oy',
	'ㅠ'=>'yu','ㅒ'=>'yay','ㅖ'=>'yey',
	'ㄱ'=>'K','ㅋ'=>'KH','ㄲ'=>'KK','ㄷ'=>'T','ㅌ'=>'TH','ㄸ'=>'TT','ㅂ'=>'P',
	'ㅍ'=>'PH','ㅃ'=>'PP','ㅈ'=>'C','ㅊ'=>'CH','ㅉ'=>'CC','ㅅ'=>'S','ㅆ'=>'SS',
	'ㅎ'=>'H','ㅇ'=>'NG','ㄴ'=>'N','ㄹ'=>'L','ㅁ'=>'M', 'ㅏ'=>'A','ㅓ'=>'E','ㅗ'=>'O',
	'ㅜ'=>'WU','ㅡ'=>'U','ㅣ'=>'I','ㅐ'=>'AY','ㅔ'=>'EY','ㅚ'=>'OY','ㅘ'=>'WA','ㅝ'=>'WE',
	'ㅟ'=>'WI','ㅙ'=>'WAY','ㅞ'=>'WEY','ㅢ'=>'UY','ㅑ'=>'YA','ㅕ'=>'YE','ㅛ'=>'OY',
	'ㅠ'=>'YU','ㅒ'=>'YAY','ㅖ'=>'YEY',

	// Lietuviu
	'č'=>'ch','ą'=>'aa','ę'=>'e','ė'=>'e','į'=>'i','š'=>'sh','ų'=>'uu','ž'=>'zh',
	'Č'=>'CH','Ą'=>'AA','Ę'=>'E','Ė'=>'E','Į'=>'I','Š'=>'SH','Ų'=>'UU','Ž'=>'ZH',
	);

	//return preg_replace(preg_quote($UTF8_SPECIAL_CHARS),"_",$string);
	$specials = preg_quote($UTF8_SPECIAL_CHARS2, '/');
	$string = preg_replace('/[\x00-\x19'.$specials.']/u',"_",$string);
	$string = strtr($string,$UTF8_ROMANIZATION);
	return $string;
}

?>
